In [22]:
import pandas as pd

In [23]:
df = pd.read_csv('static/data/hero-network.csv')
df

                       hero1                 hero2
0              LITTLE, ABNER        PRINCESS ZANDA
1              LITTLE, ABNER  BLACK PANTHER/T'CHAL
2       BLACK PANTHER/T'CHAL        PRINCESS ZANDA
3              LITTLE, ABNER        PRINCESS ZANDA
4              LITTLE, ABNER  BLACK PANTHER/T'CHAL
...                      ...                   ...
574462  COLOSSUS II/PETER RA              CALLISTO
574463              CALLISTO               ROGUE /
574464              CALLISTO              CALIBAN/
574465              CALIBAN/               ROGUE /
574466  HULK/DR. ROBERT BRUC     MARKS, DR. SHIELA

[574467 rows x 2 columns]

In [24]:
df['value'] = 1
df = df.drop(['hero2'], axis=1)
df_counts = df.groupby(['hero1']).sum()

In [25]:
#display(df_counts['value'])
#display(df_counts['hero1'])
df2 = df_counts.reset_index()
df2 = df2.sort_values(ascending=False, by='value')
display(df2)

                     hero1  value
826        CAPTAIN AMERICA   8149
5103  SPIDER-MAN/PETER PAR   6652
2555  IRON MAN/TONY STARK    5850
5520  THOR/DR. DONALD BLAK   5712
5499  THING/BENJAMIN J. GR   5369
...                    ...    ...
5640              TREVORIK      1
299                 AZRAEL      1
3313          MANTLO, BILL      1
5363                 SYLPH      1
5043     SNIPER/VON BURIAN      1

[6211 rows x 2 columns]

In [32]:
df2['hero1'] = df2['hero1'].apply(lambda x: x.split('/')[0])

In [ ]:
df2

In [26]:
#df.to_json(orient='records', path_or_buf='static/data/cleaned-hero-network.json')
#df_counts.to_csv(path_or_buf='static/data/count-hero-network.csv')
df2.to_json(path_or_buf='static/data/count-hero-network.json', orient='records')